# -*- coding utf-8 -*-

"""
@author:yankerp
@url:www.yankerphub.com
"""

"""
数据部分：
    校区的名字：如“xxxx校区”
    校区的名字：如“xxxx校区”
    
    班级名字
    班级所在校区：
    
    
    课程名字
    课程周期
    课程价格
    

    学生的学校
    学生的姓名
    学生的年龄
    学号
    学生的性别
    

    
    老师的名字
    老师的年龄
    老师的薪资
    老师的等级

功能部分：
    1、校区创建完毕后，可以为每个校区关联班级
    2、班级创建完毕后，可以为每个班级关联课程
    3、班级创建完毕后，可以为每个班级关联学生
    4、学生创建完毕后，学生可以关联课程，关联班级
    
    老师创建完毕后，可以为本班级学生打分--->选做
"""


































